<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use App\Models\Kobject;
use Illuminate\Support\Facades\File;

class KobjectSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    
        public function run(): void
        {
        //     $objects = collect([
        // "컴퓨터" => "कम्प्युटर",
        // "휴대폰" => "मोबाइल फोन",
        // "자전거" => "साइकल",
        // "책" => "किताब",
        // "가방" => "झोला",
        // "신발" => "जुत्ता",
        // "헤어드라이어" => "हेयर ड्रायर",
        // "선글라스" => "शेड्स",
        // "책상" => "मेज",
        // "의자" => "कुर्सी",
        // "커피" => "कफी",
        // "차" => "चिया",
        // "종이" => "कागज",
        // "펜" => "पेन",
        // "시계" => "घड़ी",
        // "가방" => "बस्ता",
        // "이어폰" => "इयरफोन",
        // "사진" => "तस्वीर",
        // "우산" => "छाता",
        // "마우스" => "माउस",
        // "컵" => "कप",
        // "볼펜" => "बॉलपेन",
        // "거울" => "आईना",
        // "물병" => "बोतल",
        // "책장" => "रख पुस्तक",
        // "의료용 마스크" => "मास्क",
        // "전자레인지" => "माइक्रोवेव",
        // "우유" => "दूध",
        // "요가 매트" => "योगा चटाई",
        // "핸드백" => "हैंडबैग",
        // "파일" => "फ़ाइल",
        // "티셔츠" => "टी शर्ट",
        // "치약" => "टूथपेस्ट",
        // "샴푸" => "शैम्पू",
        // "장갑" => "दस्ताना",
        // "바나나" => "केला",
        // "사과" => "सेब",
        // "키보드" => "कीबोर्ड",
        // "피아노" => "पियानो",
        // "고양이" => "बिल्ली",
        // "강아지" => "कुत्ता",
        // "햄버거" => "हैम्बर्गर",
        // "피자" => "पिज्जा",
        // "음료수" => "सोडा",
        // "사과주스" => "सेब का रस",
        // "차" => "गाड़ी",
        // "비행기" => "विमान",
        // "자전거" => "साइकिल",
        // "모자" => "टोपी",
        // "양말" => "मोजा",
        // "바지" => "पतलून",
        // "셔츠" => "कमीज",
        // "치마" => "स्कर्ट",
        // "원피스" => "ड्रेस",
        // "장갑" => "दस्ताना",
        // "스웨터" => "स्वेटर",
        // "스카프" => "स्कार्फ",
        // "코트" => "कोट",
        // "자켓" => "जैकेट",
        // "티셔츠" => "टी शर्ट",
        // "블라우스" => "ब्लाउज",
        // "트렌치코트" => "ट्रेंच कोट",
        // "후드티" => "हुडी",
        // "바지" => "शरारा",
        // "청바지" => "जींस",
        // "원피스" => "फ्रॉक",
        // "블라우스" => "चोली",
        // "비키니" => "बिकिनी",
        // "속옷" => "अंडरवियर",
        // "수영복" => "स्विमसूट",
        // "양복" => "सूट",
        // "여성복" => "लेडीज़ सूट",
        // "정장" => "फॉर्मल सूट",
        // "나이트웨어" => "नाइट वियर",
        // "침대" => "बिस्तर",
        // "의자" => "कुर्सी",
        // "테이블" => "मेज",
        // "소파" => "सोफ़ा",
        // "화장대" => "ड्रेसिंग टेबल",
        // "전자레인지" => "माइक्रोवेव",
        // "냉장고" => "रेफ़्रिज़रेटर",
        // "에어컨" => "एयर कंडीशनर",
        // "선풍기" => "फैन",
        // "텔레비전" => "टीवी",
        // "컴퓨터" => "कंप्यूटर",
        // "세탁기" => "वॉशिंग मशीन",
        // "다리미" => "इस्त्री",
        // "건조기" => "ड्रायर",
        // "전자렌지" => "माइक्रोवेव",
        // "믹서" => "मिक्सर",
        // "오븐" => "अवन",
        // # Add more objects as needed
    
        //     ]);
        $json = File::get(path:'database/json/kobjects.json');
        $objects = collect(json_decode($json));
            $objects->each(function($nepali,$korean){
                kobject::create([
                    'nepali'=>$nepali,
                    'korean'=>$korean
                ]);
    
            });
        }
    }

